Revit 2027 API
ParameterTypeId.CurtainGridBaseOrientation Property
 "Grid Base Orientation"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId CurtainGridBaseOrientation { get; }
Public Shared ReadOnly Property CurtainGridBaseOrientation As ForgeTypeId
	Get
public:
static property ForgeTypeId^ CurtainGridBaseOrientation {
	ForgeTypeId^ get ();
}
static member CurtainGridBaseOrientation : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace